app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Comprar açucar"], ["status", 0], ["created_at", "2020-07-23 17:21:16.634652"], ["updated_at", "2020-07-23 17:21:16.634652"]]
---
    def create
        @task = Task.new(params.require(:task).permit(:description, :status))
        @task.save  #salvar no db

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Comprar água"], ["status", 1], ["updated_at", "2020-07-23 23:06:00.056074"], ["id", 1]]
---
    def update
        @task = Task.find(params[:id])
        @task.update(params.require(:task).permit(:description, :status))

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
        task = Task.find(params[:id])
        task.destroy